const faq = [
  {
    question: 'چرا به شماره سفارش (DKC) نیاز داریم؟',
    answer: `
    <strong>GOGO</strong> 
    برای افزایش سرعت پاسخ گویی به مشتریان با دریافت کد سفارش یا همان کد "DKC  " این امکان رو ایجاد کرده که بتونید در زمان کمتری به نتیجه مورد نظر خود برسید
    `,
  },
  {
    question: 'میتوانم سفارشم را بصورت اقساطی ( اعتباری ) پرداخت کنم؟',
    answer:
      "بله، GOGO تسهیلاتی را فراهم کرده، شما میتوانید تا سقف 20 میلیون تومان به صورت اقساط  با بازپرداخت  6 ، 9 و 12 ماهه از سایت GOGO خرید کنید.",
  },
  {
    question: 'چطور میتوانم سفارشم را لغو کنم ؟',
    answer:
      `<ol>
        <li>شما میتوانید با مراجعه به پروفایل خود سفارش یا مرسوله ایی که از ارسال آن منصرف شدید را لغو نمایید.
        </li>
        <li>میتوانید برای مشاهده روند لغو سفارش به توضیحات تکمیلی مراجعه کنید.
        </li>
      </ol>`,
  },
  {
    question: 'رمز عبور خود را فراموش کردم، چطور میتوانم از طریق نسخه وب رمز خود را بازیابی کنم؟',
    answer:
      'با وارد کردن ایمیل خود میتوانید رمز عبور جدید از سایت دریافت کنید',
  },
  {
    question: 'چطور میتوانم فاکتور سفارش را دریافت کنم؟',
    answer:
      'با ورود به صفحه "سفارش های من و  انتخاب گزینه ی  "جزییات" سفارش مورد نظر و سپس انتخاب گزینه ی"مشاهده فاکتور"تصویر فاکتور مهر و امضاء شده را دریافت کنید.',
  },
  {
    question: 'شرایط و هزینه ارسال کالاهای بزرگ و سنگین، فوق سنگین در تهران و حومه چیست؟',
    answer:
      "اگر کالای شما جزء کالاهای سنگین باشد، هزینه ارسال آن  در  تهران، اسلامشهر و کرج بسته به وزن و ماهیت کالا از 25000 تومان  تا 60000 تومان می باشد.",
  },
  {
    question: 'ارسال موتور سیکلت به شهرستان رایگان می باشد ؟',
    answer:
      'خیر ارسال به شهرستان بر اساس نرخ باربری می باشد و در صورتی که مشتری باربری میشناسد می تواند آن را به فروشنده اعلام کند .',
  },
];

export default faq;
