const detailsQuestionsData = [
  {
    question: '1. میتوانم سفارشم را بصورت اقساطی ( اعتباری ) پرداخت کنم؟',
    answer:
      "بله، دیجی کالا تسهیلاتی را فراهم کرده، شما میتوانید تا سقف 20 میلیون تومان به صورت اقساط  با بازپرداخت  6 ، 9 و 12 ماهه از سایت دیجی کالا خرید کنید.",
    key: 'q1',
  },
  {
    question: '2. چطور میتوانم سفارشم را لغو کنم ؟',
    answer:
      `
      <ul>
      <li>شما میتوانید با مراجعه به پروفایل خود سفارش یا مرسوله ایی که از ارسال آن منصرف شدید را لغو نمایید.
      </li>
      <li>میتوانید برای مشاهده روند لغو سفارش به توضیحات تکمیلی مراجعه کنید.
      </li>
      </ul>`,
    key: 'q2',
  },
  {
    question: '3. رمز عبور خود را فراموش کردم، چطور میتوانم از طریق نسخه وب رمز خود را بازیابی کنم؟',
    answer:
      "لطفا به قسمت توضیحات تکمیلی وارد شوید.",
    key: 'q3',
  },
  {
    question: '4. در صورت بروز تاخیر در تامین کالا چطور اطلاع رسانی صورت میگیرد؟',
    answer:
      'در صورتی که تا تاریخ انتخابی شما برای ارسال ،کالا آماده ارسال نشود، صبح همان روز پیامکی برای شما جهت اطلاع رسانی تاخیر تحویل سفارش ارسال می شود.',
    key: 'q4',
  },
  {
    question: '5. چه کالاهایی از طریق باربری ارسال می شوند؟',
    answer:
      'باربری برای لوازم خانگی سنگین یا بزرگ مانند یخچال معمولی و ساید‌بای‌ساید، ماشین لباس‌شویی، ماشین ظرف‌شویی، اجاق گاز و فرتوکار، پیانو، میز تلویزیون ،کولر گازی ، کولرآبی ،مبلمان اداری و غیر اداری، کتابخانه، میز تلویزیون، میز کامپیوتر، میز جلومبلی، میز برش، میز ناهارخوری ، صندلی ماساژور، ماشین بازی بزرگ، تردمیل، موتوربرق، پرینتر و دستگاه کپی حجیم و ایستاده و سایر دستگاه‌های حجیم است و کالا به‌صورت پس‌کرایه (پرداخت هزینه باربری هنگام تحویل مرسوله) ارسال خواهد شد.',
    key: 'q5',
  },
  {
    question: '6. سفارشم را بصورت اینترنتی پرداخت نمودم ، وجه از حسابم کسر شده اما پرداخت سفارشم تایید نشده است؟',
    answer:
      'ممکن است بدلیل اختلال در درگاه بانکی انتقال وجه به بانک ناقص باشد – در اینصورت وجه بصورت خودکار طی 72 ساعت کاری مجدد بحساب شما برمیگردد.تاکید می شود، در این مورد نیازی به تماس با پشتیبانی ندارید.',
    key: 'q6',
  },
];
export default detailsQuestionsData;
